package main

import (
	"zdy_demo/kafka_consumer/process"
	"zdy_demo/module/log_record"
)

func main() {
	config := log_record.NewConfig()
	//只有1个分区 1个消费者 情况下 消费500000条消息
	//       1627392460
	// start 1627443299862339000
	// stop  1627443317722291000
	// 消费能力是  17.86秒消费完

	//3个分区 1个消费者 情况下 消费500000条消息
	//       1627392460
	// start 1627443715513449000
	// stop  1627443733031513000
	// 消费能力是   17.52秒消费完

	//3个分区 3个同组消费者 情况下 消费500000条消息
	//       1627392460
	// start 1627444042727732000
	// stop  1627444058023620000   1627444058173923000 1627444058240345000
	// 消费能力是  15.3  15.45  15.52秒消费完

	//3个分区 有两个消费者组消费 一组有3个消费者 另一组只有1个消费者    消费300000万数据
	//            1627392460
	//   start    1627451031806952000
	//3个消费者的组 1627451043840374000  1627451043835985000  1627451043908435000
	//              12.03                    12.03                12.09   秒消费完
	//1个消费者的组 1627451035780507000
	//              8.06  秒消费完
	process.LogRecordConsumer(config)
}
