package main

import "zdy_demo/rpc_client/process"

func main() {
	//1万次短连接单次rpc       总耗时 1627460985238 - 1627460981154 = 4084 ms
	//1万次长连接多次rpc       总耗时 1627461180279 - 1627461171577 = 8702 ms
	//1万次连接池并发rpc客户端  总耗时 1627480380165 - 1627480378510 = 1655 ms

	//传输格式测试   长连接非连接池下 阻塞式传输TSocket 请求十个元素的切片 一万次
	//二进制传输 TBinaryProtocol
	//总耗时 1627541918965 - 1627541906950 = 12015 ms
	//压缩格式传输 TCompactProtocol
	//总耗时 1627541971981 - 1627541961272 = 10709 ms
	//Json格式 TJSONProtocol
	//总耗时 1627542040871 - 1627542038060 = 2811 ms
	//SimpleJson格式 TSimpleJSONProtocol
	//总耗时 1627542106963 - 1627542105564 = 1399 ms

	//二进制格式  有缓冲的传输 请求十个元素的切片 一万次
	//总耗时 1627543406584 - 1627543405072 = 1512 ms
	//process.Thrift()

	process.Grpc()
}
